current_design floonoc_mesh_top

set clk_name  clk
set clk_port_name clk_i
set clk_period 1.98
set clk_io_pct 0.25

set clk_port [get_ports $clk_port_name]

create_clock -name $clk_name -period $clk_period $clk_port

set non_clock_inputs [all_inputs -no_clocks]
set_input_delay  [expr $clk_period * $clk_io_pct] -clock $clk_name $non_clock_inputs
set_output_delay [expr $clk_period * $clk_io_pct] -clock $clk_name [all_outputs]

# Async reset: exclude recovery/removal checks on rst_ni
set_false_path -from [get_ports rst_ni]
